BackendSBTA/app/Controllers/TugasAkhir.php

SELECT *
FROM `tugas_akhir`
---
    public function index()
    {
        $ta_model = new TugasAkhirModel();
        $all_data_ta = $ta_model->findAll();