app/Controllers/Bimbingan.php

    public function Proses_tambah_bimbingan()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('jadwal_bimbingan');

        $data = $this->request->getJSON(true);

        $wajib = ['id_ta', 'status', 'nidn', 'catatan_bimbingan', 'tanggal_bimbingan'];
        foreach ($wajib as $field) {
            if (empty($data[$field])) {
                return $this->response->setStatusCode(400)
                    ->setJSON(['status' => 'error', 'message' => ucfirst($field) . ' tidak boleh kosong']);
            }
        }

        unset($data['id_jadwal']);

        if ($builder->insert($data)) {
---
INSERT INTO `jadwal_bimbingan` (`id_ta`, `nidn`, `tanggal_bimbingan`, `catatan_bimbingan`, `status`) VALUES ('100', '1111', '2025-03-15', 'fhiuewfbxjiw', '1')