app/Controllers/Dosen.php

    public function Proses_tambah_dosen()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('dosen_pembimbing');

        $data = $this->request->getJSON(true);

        if (!$data || empty($data['nidn']) || empty($data['nama']) || empty($data['email']) || empty($data['no_telp'])) {
            return $this->response->setStatusCode(400)
                ->setJSON(['status' => 'error', 'message' => 'Kolom tidak boleh kosong']);
        }

        $ceknidn = $builder->where('nidn', $data['nidn'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `dosen_pembimbing`
WHERE `nidn` = '141414'

    public function Proses_edit_dosen($nidn)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('dosen_pembimbing');

        $data = $this->request->getJSON(true);

        if (!$data || empty($data['nidn']) || empty($data['nama']) || empty($data['email']) || empty($data['no_telp'])) {
            return $this->response->setStatusCode(400)
                ->setJSON(['status' => 'error', 'message' => 'Kolom tidak boleh kosong']);
        }

        $cekDosen = $builder->where('nidn', $nidn)->countAllResults();
        if ($cekDosen == 0) {
            return $this->response->setStatusCode(404)
                ->setJSON(['status' => 'error', 'message' => 'Data Dosen tidak ditemukan']);
        }

        $builder->where('nidn', $nidn);
        if ($builder->update($data)) {
---
SELECT COUNT(*) AS `numrows`
FROM `dosen_pembimbing`
WHERE `nidn` = '7777'
UPDATE `dosen_pembimbing` SET `nidn` = '8888', `nama` = 'Yana A', `email` = 'dianaaprilia745@gmail.com', `no_telp` = '081949463133'
WHERE `nidn` = '7777'