app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'mahasiswa'
---
    public function Proses_login()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('user');

        $data = $this->request->getJSON(true);

        // Validasi input
        if (empty($data['username']) || empty($data['password'])) {
            return $this->response->setStatusCode(400)
                ->setJSON(['status' => 'error', 'message' => 'Username dan Password wajib diisi']);
        }

        // Ambil data user berdasarkan username
        $user = $builder->where('username', $data['username'])->get()->getRowArray();