app/Controllers/Mahasiswa.php

    public function index()
    {
        $mahasiswa_model = new MahasiswaModel();
        $all_data_mahasiswa = $mahasiswa_model->findAll();
---
SELECT *
FROM `mahasiswa`

    public function Proses_tambah_mahasiswa()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('mahasiswa'); // Nama tabel di database

        // Ambil data dari request (format JSON)
        $data = $this->request->getJSON(true);

        // Pastikan semua kolom wajib diisi
        if (!$data || empty($data['npm']) || empty($data['nama']) || empty($data['angkatan']) || empty($data['email']) || empty($data['no_telp'])) {
            return $this->response->setStatusCode(400)
                ->setJSON(['status' => 'error', 'message' => 'Kolom tidak boleh kosong']);
        }

        // Cek apakah NPM sudah ada
        $cekNpm = $builder->where('npm', $data['npm'])->countAllResults();
        if ($cekNpm > 0) {
            return $this->response->setStatusCode(409)
                ->setJSON(['status' => 'error', 'message' => 'NPM sudah terdaftar']);
        }

        // Insert data mahasiswa ke database
        if ($builder->insert($data)) {
---
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
WHERE `npm` = '240102090'
INSERT INTO `mahasiswa` (`npm`, `nama`, `angkatan`, `email`, `no_telp`) VALUES ('230202011', 'Yana A', 2023, 'dianaaprilia745@gmail.com', '081949463133')

    public function Edit_data_mahasiswa($npm = false)
    {
        $mahasiswa_model = new MahasiswaModel();
        $data_mahasiswa = $mahasiswa_model->find($npm);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`npm` = '230102027'

    public function Proses_edit_mahasiswa($npm)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('mahasiswa'); // Nama tabel di database

        // Mengambil data dari request PUT (JSON)
        $data = $this->request->getJSON(true);

        // Pastikan data tidak kosong
        if (!$data || empty($data['npm']) || empty($data['nama']) || empty($data['angkatan']) || empty($data['email']) || empty($data['no_telp'])) {
            return $this->response->setStatusCode(400)
                ->setJSON(['status' => 'error', 'message' => 'Kolom tidak boleh kosong']);
        }

        // Cek apakah mahasiswa dengan NPM tersebut ada
        $cekMahasiswa = $builder->where('npm', $npm)->countAllResults();
        if ($cekMahasiswa == 0) {
            return $this->response->setStatusCode(404)
                ->setJSON(['status' => 'error', 'message' => 'Data Mahasiswa tidak ditemukan']);
        }

        // Update data mahasiswa berdasarkan NPM
        $builder->where('npm', $npm);
        if ($builder->update($data)) {
---
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
WHERE `npm` = '230102026'
UPDATE `mahasiswa` SET `npm` = '230102027', `nama` = 'Amel Adellia', `angkatan` = '2023', `email` = 'ameladellia815@gmail.com', `no_telp` = '081229590051'
WHERE `npm` = '230102026'

    public function Hapus_data_mahasiswa($npm = false)
    {
        $mahasiswa_model = new MahasiswaModel();
        if ($mahasiswa_model->delete($npm)) {
---
DELETE FROM `mahasiswa`
WHERE `npm` IN ('230102011')