app/Controllers/User.php

INSERT INTO `user` (`username`, `password`, `role`) VALUES ('0000', '1111', 'dosen')
---
    public function Proses_tambah_user()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('user');

        $data = $this->request->getJSON(true);

        $wajib = ['username', 'password', 'role'];
        foreach ($wajib as $field) {
            if (empty($data[$field])) {
                return $this->response->setStatusCode(400)
                    ->setJSON(['status' => 'error', 'message' => ucfirst($field) . ' tidak boleh kosong']);
            }
        }

        unset($data['id_user']);

        if ($builder->insert($data)) {

SELECT *
FROM `user`
WHERE `user`.`id_user` = '0'
---
    public function Edit_data_user($id_user = false)
    {
        $user_model = new UserModel();
        $data_user = $user_model->find($id_user);